/*
1. 다음 괄호 안을 채우시오.
(1) 표현식
(2) 문장 
(3) 키워드(예약어)
(4) 식별자
(5) 불
(6) true
(7) false
(8) false
(9) 변수
(10) 상수
(11) const
(12) let 
(13) typeof
(14) NaN

2. 다음 질문에 OX를 표시하시오.
(1) X
세미콜론 또는 줄바꿈으로 문장을 종결할 수 있습니다.
(2) O
(3) O
(4) X
포함할 수 없습니다.
(5) O
(6) X
영향을 주지 않습니다.
(7) X 
// 기호를 사용합니다.
(8) O
(9) X 
자바스크립트는 굉장히 유연한 프로그래밍 언어이므로, 변수에 여러 종류의 자료형을 넣을 수 있습니다.
(10)  O
(11)  X 
100입니다.
3. ④ 
4. ③  
5. ①, ④ 
6. ② 
7. 
실행 결과	
325
52273
52273
52273

8. 
실행 결과	
30!!!!



























*/


const number = 10;
console.log(number++);
console.log(++number);
console.log(number++);
console.log(++number);